In [73]:
import numpy as np
import pandas as pd

ERROR! Session/line number was not unique in database. History logging moved to new session 135

In [74]:
df = pd.read_csv('tips.csv')

In [75]:
# [1] DataFrame에 대한 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [76]:
# [2] DataFrame에 대한 통계값 확인 - 숫자형 Column에 대해
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [78]:
# [3] Series에 대한 통계값 확인 - 숫자 column에 대해
df['size'].describe()

count    244.000000
mean       2.569672
std        0.951100
min        1.000000
25%        2.000000
50%        2.000000
75%        3.000000
max        6.000000
Name: size, dtype: float64

In [79]:
# [4] DataFrame에 대한 통계값 확인 - 범주형 Column에 대해
df.describe(include='O')

         sex smoker  day    time
count    244    244  244     244
unique     2      2    4       2
top     Male     No  Sat  Dinner
freq     157    151   87     176

Sum 입력 방식

DataFrame.sum(axis=0, skipna=True, level=None, numeric_only=None, min_count=0, **kwargs)

In [80]:
# [5] 특정 통계량 구하기 - mean, var, std, min, max, quantile, median
df.sum(numeric_only=True)  
#df.sum(axis=0, numeric_only=True)  Default 값은 axis=0이므로 Column에 대해 sum을 구함, axis=1으로 하면 행 별로 계산

total_bill    4827.77
tip            731.58
size           627.00
dtype: float64

In [81]:
df.min(numeric_only="True")

total_bill    3.07
tip           1.00
size          1.00
dtype: float64

In [82]:
df.max(numeric_only="True")

total_bill    50.81
tip           10.00
size           6.00
dtype: float64

In [83]:
df.median(numeric_only="True")

total_bill    17.795
tip            2.900
size           2.000
dtype: float64

In [84]:
df.quantile([0.25, 0.5, 0.75], numeric_only=True)

      total_bill     tip  size
0.25     13.3475  2.0000   2.0
0.50     17.7950  2.9000   2.0
0.75     24.1275  3.5625   3.0

### DataFrame.sort_values()
- DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key=None)
- by: 정렬 기준이 되는 column
- ascending: True-오름차순/False-내림차순

In [85]:
df.sort_values(by='tip', ascending=False)

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
212       48.33   9.00    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
..          ...    ...     ...    ...   ...     ...   ...
0         16.99   1.01  Female     No   Sun  Dinner     2
236       12.60   1.00    Male    Yes   Sat  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2

[244 rows x 7 columns]

In [86]:
# size의 오름차순, tip의 내림차순
df.sort_values(by=['size','tip'], ascending=[True,False])

     total_bill   tip     sex smoker   day    time  size
222        8.58  1.92    Male    Yes   Fri   Lunch     1
82        10.07  1.83  Female     No  Thur   Lunch     1
67         3.07  1.00  Female    Yes   Sat  Dinner     1
111        7.25  1.00  Female     No   Sat  Dinner     1
88        24.71  5.85    Male     No  Thur   Lunch     2
..          ...   ...     ...    ...   ...     ...   ...
187       30.46  2.00    Male    Yes   Sun  Dinner     5
141       34.30  6.70    Male     No  Thur   Lunch     6
143       27.05  5.00  Female     No  Thur   Lunch     6
156       48.17  5.00    Male     No   Sun  Dinner     6
125       29.80  4.20  Female     No  Thur   Lunch     6

[244 rows x 7 columns]

#### Series에서 사용하는 것들
- s.uniuqe()
- s.value_counts()
- s.str.replace() #s.dtype이 ojbect(str)이여야함

In [87]:
df3=df.copy()
df3.loc[:,'sex':'time'] = df3.loc[:,'sex':'time'].astype('str')
df3.dtypes

total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [88]:
df3

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [89]:
df3['time'].unique()

array(['Dinner', 'Lunch'], dtype=object)

In [90]:
df3['size'].unique()

array([2, 3, 4, 1, 6, 5], dtype=int64)

In [91]:
# 범주별 sample 개수
df3['time'].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [92]:
df3.sort_index(axis=1).head(2)

   day     sex  size smoker    time   tip  total_bill
0  Sun  Female     2     No  Dinner  1.01       16.99
1  Sun    Male     3     No  Dinner  1.66       10.34

In [93]:
df3.copy()['smoker'].str.replace('No', 'N').replace('Yes', 'Y')

0      N
1      N
2      N
3      N
4      N
      ..
239    N
240    Y
241    Y
242    N
243    N
Name: smoker, Length: 244, dtype: object

In [94]:
#위와 같은 함수인데 이 방식이 더 편함
#replace 안에 올 수 있는 것들이 str 외에도 list, tuple 등 여러 종류가 올 수 있음
df3.copy()['smoker'].replace(['No','Yes'],['N','Y'])

0      N
1      N
2      N
3      N
4      N
      ..
239    N
240    Y
241    Y
242    N
243    N
Name: smoker, Length: 244, dtype: object

In [95]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [96]:
# Column의 이름을 바꾸고 싶을 경우
df = df.copy().rename(columns={'tip': 'TIP', 'day':'weekday'})
df.head()

   total_bill   TIP     sex smoker weekday    time  size
0       16.99  1.01  Female     No     Sun  Dinner     2
1       10.34  1.66    Male     No     Sun  Dinner     3
2       21.01  3.50    Male     No     Sun  Dinner     3
3       23.68  3.31    Male     No     Sun  Dinner     2
4       24.59  3.61  Female     No     Sun  Dinner     4

In [97]:
df['total_bill'].round(1)

0      17.0
1      10.3
2      21.0
3      23.7
4      24.6
       ...
239    29.0
240    27.2
241    22.7
242    17.8
243    18.8
Name: total_bill, Length: 244, dtype: float64

### Pandas의 주요 함수 (2022.10.21)
- df.astype(), s.astype()
- pd.to_numeric(1D array or Series, errors={'ignore', 'raise', 'coerce'})
- 결측치 : NA, NaN, nan
    - 결측치 확인: df.isna(), df.notna(), s.isna(), snotna()
    - 결측치 삭제: df.dropna()
    - 결측치 치환: df.fillna()

In [98]:
import numpy as np
import pandas as pd

a = np.arange(1,10,1).reshape(3,3)
df = pd.DataFrame(a, columns=['X1','X2','X3'], index=['A','B','C'])
df

   X1  X2  X3
A   1   2   3
B   4   5   6
C   7   8   9

In [99]:
df.astype('float')

    X1   X2   X3
A  1.0  2.0  3.0
B  4.0  5.0  6.0
C  7.0  8.0  9.0

In [100]:
df2 = df.copy()
df2[['X1', 'X3']]=df2[['X1', 'X3']].astype('float')
df2

    X1  X2   X3
A  1.0   2  3.0
B  4.0   5  6.0
C  7.0   8  9.0

In [101]:
df.astype({'X1':float, 'X3':float})

    X1  X2   X3
A  1.0   2  3.0
B  4.0   5  6.0
C  7.0   8  9.0

In [102]:
s=pd.Series(['1','2','3','4','a'])
[type(x) for x in s] # 'a'가 str이므로 나머지 숫자도 다 str 취급됨
#s.astype(int) #ValueError: invalid literal for int() with base 10: 'a'
#pd.to_numeric(s) #ValueError: Unable to parse string "a" at position 4
#pd.to_numeric(s, errors='raise') #default값으로 위와 같은 동작
print(pd.to_numeric(s, errors='ignore'),'\n')
print(pd.to_numeric(s, errors='coerce'))
#pd.to_numeric(1D array or Series, errors={'ignore', 'raise', 'coerce'})

0    1
1    2
2    3
3    4
4    a
dtype: object

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [103]:
s=pd.Series(['1','2','3','4','*7'])
print(s,'\n')
#pd.to_numeric(s)  #ValueError: Unable to parse string "*7" at position 4

# 아래는 다 동일한 거를 출력
s.str.strip('*').astype('int') #원래는 ' ' 안에 넣는게 정석
s.str.strip('*').astype(int)  #그런데 int는 파이썬 내장함수므로 '' 안에 넣을 필요 없음 
s.str.strip('*').astype(np.int32)  #' ' 를 안 쓰고 싶으면 np. 을 활용하면 됨

0     1
1     2
2     3
3     4
4    *7
dtype: object

0    1
1    2
2    3
3    4
4    7
dtype: int32

### 결측치

In [104]:
import numpy as np
import pandas as pd

np.random.seed(0)
df=pd.DataFrame(np.random.randn(5,5), columns=list('ABCDE'))
df = df[df>0]
df

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1       NaN  0.950088       NaN       NaN  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079       NaN  0.313068       NaN
4       NaN  0.653619  0.864436       NaN  2.269755

In [105]:
# 결측치 True, 결측치 아닌 것 False
df.isna()
#df.isnull()

       A      B      C      D      E
0  False  False  False  False  False
1   True  False   True   True  False
2  False  False  False  False  False
3  False  False   True  False   True
4   True  False  False   True  False

In [106]:
# 결측치 False, 결측치 아닌 것 True
df.notna()
#df.notnull()

       A     B      C      D      E
0   True  True   True   True   True
1  False  True  False  False   True
2   True  True   True   True   True
3   True  True  False   True  False
4  False  True   True  False   True

In [107]:
# Column 별 결측치 개수
df.isna().sum()

A    2
B    0
C    2
D    2
E    1
dtype: int64

In [108]:
# Row 별 결측치 개수
df.isna().sum(axis=1)

0    0
1    3
2    0
3    2
4    2
dtype: int64

In [109]:
#전체 결측치 개수
df.isna().sum().sum()

7

### 결측치 삭제
DataFrame.dropna(*, axis=0, how=_NoDefault.no_default, thresh=_NoDefault.no_default, subset=None, inplace=False)
- axis
- how: 'any', 'ignore', 'coerce'
- thresh: NA가 아닌 삭제 기준 지정(ex: 3이라고 하면 결측치 개수 3개 미만인거 제거)
- inplace: 원본을 수정하고자 할 때는 inplace를 True라고 함

In [110]:
df

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1       NaN  0.950088       NaN       NaN  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079       NaN  0.313068       NaN
4       NaN  0.653619  0.864436       NaN  2.269755

In [111]:
# 행에 결측치가 하나만 있어도 행 삭제
df.dropna()
df.dropna(axis=0, how='any')

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
2  0.144044  1.454274  0.761038  0.121675  0.443863

In [112]:
# 열에 결측치가 하나만 있어도 열 삭제
df.dropna(axis=1)
df.dropna(axis=1, how='any')

          B
0  0.400157
1  0.950088
2  1.454274
3  1.494079
4  0.653619

In [123]:
# pandas 1.5에서는 how랑 thresh 동시 사용 불가
display(df)

df.dropna(axis=0, thresh=3)

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1       NaN  0.950088       NaN       NaN  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079       NaN  0.313068       NaN
4       NaN  0.653619  0.864436       NaN  2.269755

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079       NaN  0.313068       NaN
4       NaN  0.653619  0.864436       NaN  2.269755

In [114]:
# 특정 Column 기준으로 해당 Column에 결측치가 있을 때에만 열에 결측치 제거
df.dropna(axis=0, subset=['E'])

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1       NaN  0.950088       NaN       NaN  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
4       NaN  0.653619  0.864436       NaN  2.269755

### 결측치 대체
DataFrame.fillna(value=None, *, method=None, axis=None, inplace=False, limit=None, downcast=None)

In [115]:
df

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1       NaN  0.950088       NaN       NaN  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079       NaN  0.313068       NaN
4       NaN  0.653619  0.864436       NaN  2.269755

In [116]:
df.fillna(0)

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1  0.000000  0.950088  0.000000  0.000000  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079  0.000000  0.313068  0.000000
4  0.000000  0.653619  0.864436  0.000000  2.269755

In [117]:
df.mean()

A    0.747257
B    0.990443
C    0.868071
D    0.891879
E    1.247944
dtype: float64

In [118]:
# Column 별로 각각의 평균값으로 채우기
df.fillna(df.mean())

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1  0.747257  0.950088  0.868071  0.891879  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079  0.868071  0.313068  1.247944
4  0.747257  0.653619  0.864436  0.891879  2.269755

In [119]:
df.fillna(method='ffill')

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1  1.764052  0.950088  0.978738  2.240893  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079  0.761038  0.313068  0.443863
4  0.333674  0.653619  0.864436  0.313068  2.269755

In [120]:
# 행 별로 채우기, 이전 정상값으로 채우기(최대 1회)
print(df)
df.fillna(axis=1, method='ffill', limit=1)

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1       NaN  0.950088       NaN       NaN  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079       NaN  0.313068       NaN
4       NaN  0.653619  0.864436       NaN  2.269755

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1       NaN  0.950088  0.950088       NaN  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079  1.494079  0.313068  0.313068
4       NaN  0.653619  0.864436  0.864436  2.269755

In [121]:
import numpy as np
import pandas as pd

np.random.seed(0)
df=pd.DataFrame(np.random.randn(5,5), columns=list('ABCDE'))
df = df[df>0]
df

          A         B         C         D         E
0  1.764052  0.400157  0.978738  2.240893  1.867558
1       NaN  0.950088       NaN       NaN  0.410599
2  0.144044  1.454274  0.761038  0.121675  0.443863
3  0.333674  1.494079       NaN  0.313068       NaN
4       NaN  0.653619  0.864436       NaN  2.269755